
# CDM system for front-end

Информация для разработчиков front-end части системы. 

## Структура проекта

Для работы с данными необходимо знать, как они устроены. Роут `/dev` имеет конечные точки для получения списка всех моделей и всей информации о них. 
## API

#### Получить все модели

```http
  GET /dev/models
```
Вернётся массив с названиями моделей и их полями.

#### Получить подробную информацию о модели

```http
  GET /dev/models/${name}
```
Вернётся объект с полями, роутами и т.д.

| Параметр | Тип     | Описание                       |
| :-------- | :------- | :-------------------------------- |
| `name`      | `string` | **Обязательно**. Имя модели для получения подробной информации |

